import { useParams } from "react-router";
import { images } from "~/image-stack";
import { MetaFunction } from "@remix-run/node";

export const meta: MetaFunction = () => ({
  "theme-color": "black",
});

export default function Post() {
  const { postId } = useParams();
  const image = Number(postId) ? images[Number(postId)] : null;

  return (
    <div>
      {image ? (
        <img
          src={image.src}
          className="mx-auto mb-4 h-[300px] w-full object-cover md:h-[400px]"
        />
      ) : null}
      <section className="p-2 md:p-12">
        <h1 className="font-caravan text-7xl text-greenSecondary md:text-9xl">
          תפסיקו להיות בטלפון בנהיגה
        </h1>
        <div className="mb-14 mt-10 h-[6px] w-[1000px] max-w-full bg-greenSecondary" />
        <p className="mx-auto max-w-[900px] text-justify font-frankRe text-2xl text-black md:text-3xl md:leading-12">
          אחת הבעיות החריפות לדעתי שאנחנו חייבים לטפל - זה נייד בזמן הנהיגה. זה
          לא חדש לאף אחד שהמון נהגים בארץ מחזיקים טלפון ומתעסקים בו בזמן הנהיגה.
          איכהו אנחנו התרגלנו לזה וזה לא מפתיע אותנו כל כך, אבל לא אותי. כל פעם
          שאני יוצא לרחוב מול הביתי אני נתקל באותה תופעה כל היום: העניים של
          הנהגים מכוונות למטה. כשאני נוהג אני פוגש לפחות כמה אנשים שלא מרוכזים
          בכביש. אז נכון שמשטרה מנסה לעכוף את זה ובכניסה לתל אביב לעיתים קרובות
          מסתובבים אופנוענים וזורקים מבט אל תוך הרכב. אבל זה ממש ממש לא מספיק.
          בכשיב מהיר, כמו 6, לדוגמה לא זכור לי פעם אחת שמישהו חיפש נהגים כאלה.
          יש לנו איזה רחוב מרכזי בעיר איפה שעוברים הרבה רכבים וגם הרבה הולכי רגל
          חוצים את הכביש. אני חושב שעובדה שעדיין לא היתה שם תעונה זה נס ורק
          בכזות השם. מעבר חצייה מובדל היטב ובולט כך שקשה לא לשים לב אליו. בנוסף
          קיים גם במפר מעל המעבר כך שמכוניות חייבות להאט לפני הגעתה. לפי הגיון
          התנוע אמורה להיות רגועה באותו מקום. מסתבר שבמציאות נהגים מספיקים לעצור
          רק ברגע אחרון כי שמו מלא גז בתחילת הרחוב. הולכי רגל, לרבות ילדים
          מתחילים הליכה לא מוואדים עד הסוף שמצב ביטיחותי. כל פעם אני נבהל מקרה
          כזה כשאני עומד בתחנת אוטובוס בתחנה ההיא. אם זה מה שקורה כשנהגים
          ״ערניים״, אשפר לדמיין מה קורה כשמחזיקים טלפטו בידיים. הפתרון צריך לבוא
          מטכנולוגיה וחדשנות בדרף עכיפת חוק. אפשר להשתמש ברחפנים אשר יכולים
          לפטרל כבישים ולזהות נהגים הלא אחראיים. אני בטוח שאפשר להגיע עוד להרבה
          פתרונות יצירתיים. אבל חייבים לטפל בזה. יש לזה קשר ישיר לתעונות דרכים
          ומניעת אסונות כאלה.
        </p>
      </section>
    </div>
  );
}
